OpenEVSE/openevse_esp32_firmware/src/net_manager.cpp
#include "emonesp.h"
#include "net_manager.h"
#include "app_config.h"
#include "lcd.h"
#include "espal.h"
#include "time_man.h"
#include "event.h"

#include "LedManagerTask.h"

#ifdef ESP32
#include <WiFi.h>
#include <esp_wifi.h>
#include <ESPmDNS.h>              // Resolve URL for update server etc.
#elif defined(ESP8266)
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>              // Resolve URL for update server etc.
#else
#error Platform not supported
#endif

#include <MongooseCore.h>

#include <DNSServer.h>                // Required for captive portal

#ifdef ENABLE_WIRED_ETHERNET
#include <ETH.h>
#endif

#ifdef ESP32
#include "wifi_esp32.h"
#endif

#ifndef WIRED_CONNECT_TIMEOUT
#define WIRED_CONNECT_TIMEOUT (15 * 1000)
#endif

#ifndef ACCESS_POINT_AUTO_STOP_TIMEOUT
#define ACCESS_POINT_AUTO_STOP_TIMEOUT (10 * 1000)
#endif

NetManagerTask *NetManagerTask::_instance = NULL;

NetManagerTask::NetManagerTask(LcdTask &lcd, LedManagerTask &led, TimeManager &time) :
  _dnsServerStarted(false),
  _dnsPort(53),
  _softAP_ssid("OpenEVSE"),
  _softAP_password("openevse"),
  _apIP(192, 168, 4, 1),
  _apNetMask(255, 255, 255, 0),
  _apClients(0),
  _state(NetState::Starting),
  _ipaddress(""),
  _macaddress(""),
  _clientDisconnects(0),
  _clientRetry(false),
  _clientRetryTime(0),
  _wifiButtonState(!WIFI_BUTTON_PRESSED_STATE),
  _wifiButtonTimeOut(millis()),
  _apMessage(false),
  _mdnsStarted(false),
  #ifdef ENABLE_WIRED_ETHERNET
  _ethConnected(false),
  #endif
  _lcd(lcd),
  _led(led),
  _time(time)
{
}

void NetManagerTask::begin()
{
  if(NULL == _instance)
  {
    _instance = this;
    MicroTask.startTask(this);
  }
}

// -------------------------------------------------------------------
// Start Access Point
// Access point is used for wifi network selection
// -------------------------------------------------------------------
void NetManagerTask::wifiStartAccessPoint()
{
  DBUGLN("Starting AP");

  DBUGVAR(isWifiModeAp());
  DBUGVAR(isWifiModeSta());

  if((esid == 0 || esid == "") && isWifiModeSta()) {
    WiFi.disconnect(true);
  }

  WiFi.enableAP(true);
  WiFi.enableSTA(true); // Needed for scanning
  WiFi.softAPConfig(_apIP, _apIP, _apNetMask);
  // set country code to "world safe mode"
  esp_wifi_set_country_code("01", true);

  String softAP_ssid;

  if (ap_ssid.length() < 2) {
     // Create Unique SSID e.g "OpenEVSE_XXXXXX"
    softAP_ssid = String(_softAP_ssid) + "_" + ESPAL.getShortId();
  }
  else {
    softAP_ssid = ap_ssid;
  }

  // Use the existing channel if set
  int channel = WiFi.channel();
  DBUGVAR(channel);
  if(0 == channel || esid == 0 || esid == "") {
    // Pick a random channel out of 1, 6 or 11
    channel = (random(3) * 5) + 1;
  }
  DBUGVAR(channel);
  WiFi.softAP(softAP_ssid.c_str(), ap_pass.length()>=8?ap_pass.c_str():_softAP_password, channel);

  // Setup the DNS server redirecting all the domains to the apIP
  _dnsServer.setErrorReplyCode(DNSReplyCode::NoError);
  _dnsServerStarted = _dnsServer.start(_dnsPort, "*", _apIP);

  IPAddress myIP = WiFi.softAPIP();

  char tmpStr[40];
  sprintf(tmpStr, "%d.%d.%d.%d", myIP[0], myIP[1], myIP[2], myIP[3]);
  _ipaddress = tmpStr;
  _macaddress = WiFi.macAddress();

  DEBUG.printf("AP IP Address: %s\n", tmpStr);
  DEBUG.printf("Channel: %d\n", WiFi.channel());

  _lcd.display(softAP_ssid, 0, 0, 0, LCD_CLEAR_LINE);
  _lcd.display(String(F("Pass: ")) + _softAP_password, 0, 1, 15 * 1000, LCD_CLEAR_LINE);

  _led.setWifiMode(false, false);
  _lcd.setWifiMode(false, false);
  _apClients = 0;
  _state = NetState::AccessPointConnecting;
}

void NetManagerTask::wifiStopAccessPoint()
{
  WiFi.softAPdisconnect(true);
  _dnsServer.stop();
  _dnsServerStarted = false;
}

// -------------------------------------------------------------------
// Start Client, attempt to connect to Wifi network
// -------------------------------------------------------------------
void NetManagerTask::wifiStartClient()
{
  wifiClientConnect();

  _led.setWifiMode(true, false);
  _lcd.setWifiMode(true, false);
  _state = NetState::StationClientConnecting;
}

void NetManagerTask::wifiClientConnect()
{
  DEBUG.print("Connecting to SSID: ");
  DEBUG.println(esid.c_str());
  // DEBUG.print(" epass:");
  // DEBUG.println(epass.c_str());

  WiFi.hostname(esp_hostname.c_str());
  WiFi.setSleep(WIFI_PS_NONE);
  WiFi.setScanMethod(WIFI_ALL_CHANNEL_SCAN);
  WiFi.setSortMethod(WIFI_CONNECT_AP_BY_SIGNAL);
  WiFi.begin(esid.c_str(), epass.c_str());

  _clientRetryTime = millis() + WIFI_CLIENT_RETRY_TIMEOUT;
}

void NetManagerTask::wifiScanNetworks(WiFiScanCompleteCallback callback)
{
  if(WiFi.scanComplete() != WIFI_SCAN_RUNNING) {
    WiFi.scanNetworks(true, false, false);
  }
  _scanCompleteCallbacks.push_back(callback);
}

void NetManagerTask::displayState()
{
  _lcd.display(F("Hostname:"), 0, 0, 0, LCD_CLEAR_LINE);
  _lcd.display(esp_hostname.c_str(), 0, 1, 5000, LCD_CLEAR_LINE);

  _lcd.display(F("IP Address:"), 0, 0, 0, LCD_CLEAR_LINE);
  _lcd.display(_ipaddress.c_str(), 0, 1, 5000, LCD_CLEAR_LINE);
}

void NetManagerTask::haveNetworkConnection(IPAddress myAddress)
{
  char tmpStr[40];
  sprintf(tmpStr, "%d.%d.%d.%d", myAddress[0], myAddress[1], myAddress[2], myAddress[3]);
  _ipaddress = tmpStr;
  _macaddress = WiFi.macAddress();

  DEBUG.print("Connected, IP: ");
  DEBUG.println(tmpStr);

  displayState();

  Mongoose.ipConfigChanged();

  _led.setWifiMode(true, true);
  _lcd.setWifiMode(true, true);
  _time.setHost(sntp_hostname.c_str());

  _apAutoApStopTime = millis() + ACCESS_POINT_AUTO_STOP_TIMEOUT;

  // The netif is up now — safe to (re)start the mDNS responder.
  startMDNS();

  _state = NetState::Connected;
}

void NetManagerTask::wifiOnStationModeConnected(const WiFiEventStationModeConnected &event) {
  DBUGF("Connected to %s", event.ssid.c_str());
}

void NetManagerTask::wifiOnStationModeGotIP(const WiFiEventStationModeGotIP &event)
{
  haveNetworkConnection(WiFi.localIP());
  _macaddress = WiFi.macAddress();
  StaticJsonDocument<128> doc;
  doc["wifi_client_connected"] = (int)net.isWifiClientConnected();
  doc["eth_connected"] = (int)net.isWiredConnected();
  doc["net_connected"] = (int)net.isWifiClientConnected();
  doc["ipaddress"] = net.getIp();
  doc["macaddress"] = net.getMac();
  event_send(doc);

  // Clear any error state
  _clientDisconnects = 0;
}

void NetManagerTask::wifiOnStationModeDisconnected(const WiFiEventStationModeDisconnected &event)
{
  DBUGF("WiFi dissconnected: %s",
    WIFI_DISCONNECT_REASON_UNSPECIFIED == event.reason ? "WIFI_DISCONNECT_REASON_UNSPECIFIED" :
    WIFI_DISCONNECT_REASON_AUTH_EXPIRE == event.reason ? "WIFI_DISCONNECT_REASON_AUTH_EXPIRE" :
    WIFI_DISCONNECT_REASON_AUTH_LEAVE == event.reason ? "WIFI_DISCONNECT_REASON_AUTH_LEAVE" :
    WIFI_DISCONNECT_REASON_ASSOC_EXPIRE == event.reason ? "WIFI_DISCONNECT_REASON_ASSOC_EXPIRE" :
    WIFI_DISCONNECT_REASON_ASSOC_TOOMANY == event.reason ? "WIFI_DISCONNECT_REASON_ASSOC_TOOMANY" :
    WIFI_DISCONNECT_REASON_NOT_AUTHED == event.reason ? "WIFI_DISCONNECT_REASON_NOT_AUTHED" :
    WIFI_DISCONNECT_REASON_NOT_ASSOCED == event.reason ? "WIFI_DISCONNECT_REASON_NOT_ASSOCED" :
    WIFI_DISCONNECT_REASON_ASSOC_LEAVE == event.reason ? "WIFI_DISCONNECT_REASON_ASSOC_LEAVE" :
    WIFI_DISCONNECT_REASON_ASSOC_NOT_AUTHED == event.reason ? "WIFI_DISCONNECT_REASON_ASSOC_NOT_AUTHED" :
    WIFI_DISCONNECT_REASON_DISASSOC_PWRCAP_BAD == event.reason ? "WIFI_DISCONNECT_REASON_DISASSOC_PWRCAP_BAD" :
    WIFI_DISCONNECT_REASON_DISASSOC_SUPCHAN_BAD == event.reason ? "WIFI_DISCONNECT_REASON_DISASSOC_SUPCHAN_BAD" :
    WIFI_DISCONNECT_REASON_IE_INVALID == event.reason ? "WIFI_DISCONNECT_REASON_IE_INVALID" :
    WIFI_DISCONNECT_REASON_MIC_FAILURE == event.reason ? "WIFI_DISCONNECT_REASON_MIC_FAILURE" :
    WIFI_DISCONNECT_REASON_4WAY_HANDSHAKE_TIMEOUT == event.reason ? "WIFI_DISCONNECT_REASON_4WAY_HANDSHAKE_TIMEOUT" :
    WIFI_DISCONNECT_REASON_GROUP_KEY_UPDATE_TIMEOUT == event.reason ? "WIFI_DISCONNECT_REASON_GROUP_KEY_UPDATE_TIMEOUT" :
    WIFI_DISCONNECT_REASON_IE_IN_4WAY_DIFFERS == event.reason ? "WIFI_DISCONNECT_REASON_IE_IN_4WAY_DIFFERS" :
    WIFI_DISCONNECT_REASON_GROUP_CIPHER_INVALID == event.reason ? "WIFI_DISCONNECT_REASON_GROUP_CIPHER_INVALID" :
    WIFI_DISCONNECT_REASON_PAIRWISE_CIPHER_INVALID == event.reason ? "WIFI_DISCONNECT_REASON_PAIRWISE_CIPHER_INVALID" :
    WIFI_DISCONNECT_REASON_AKMP_INVALID == event.reason ? "WIFI_DISCONNECT_REASON_AKMP_INVALID" :
    WIFI_DISCONNECT_REASON_UNSUPP_RSN_IE_VERSION == event.reason ? "WIFI_DISCONNECT_REASON_UNSUPP_RSN_IE_VERSION" :
    WIFI_DISCONNECT_REASON_INVALID_RSN_IE_CAP == event.reason ? "WIFI_DISCONNECT_REASON_INVALID_RSN_IE_CAP" :
    WIFI_DISCONNECT_REASON_802_1X_AUTH_FAILED == event.reason ? "WIFI_DISCONNECT_REASON_802_1X_AUTH_FAILED" :
    WIFI_DISCONNECT_REASON_CIPHER_SUITE_REJECTED == event.reason ? "WIFI_DISCONNECT_REASON_CIPHER_SUITE_REJECTED" :
    WIFI_DISCONNECT_REASON_BEACON_TIMEOUT == event.reason ? "WIFI_DISCONNECT_REASON_BEACON_TIMEOUT" :
    WIFI_DISCONNECT_REASON_NO_AP_FOUND == event.reason ? "WIFI_DISCONNECT_REASON_NO_AP_FOUND" :
    WIFI_DISCONNECT_REASON_AUTH_FAIL == event.reason ? "WIFI_DISCONNECT_REASON_AUTH_FAIL" :
    WIFI_DISCONNECT_REASON_ASSOC_FAIL == event.reason ? "WIFI_DISCONNECT_REASON_ASSOC_FAIL" :
    WIFI_DISCONNECT_REASON_HANDSHAKE_TIMEOUT == event.reason ? "WIFI_DISCONNECT_REASON_HANDSHAKE_TIMEOUT" :
    "UNKNOWN");

