OpenEVSE/openevse_esp32_firmware/src/net_manager.cpp
  // If we have an SSID configured at this point we have likely
  // been running another firmware, clear the results
  if(isWifiClientConfigured()) {
    WiFi.persistent(true);
    WiFi.disconnect();
    ESPAL.eraseConfig();
  }

  // Stop the WiFi module
  WiFi.persistent(false);
  WiFi.mode(WIFI_OFF);

#ifdef ESP32
  WiFi.onEvent(onNetEventStatic);
#else
// TODO: Needs fixing if we ever support ESP8622
//  static auto _onStationModeConnected = WiFi.onStationModeConnected(net_wifi_onStationModeConnected);
//  static auto _onStationModeGotIP = WiFi.onStationModeGotIP(net_wifi_onStationModeGotIP);
//  static auto _onStationModeDisconnected = WiFi.onStationModeDisconnected(net_wifi_onStationModeDisconnected);
//  static auto _onSoftAPModeStationConnected = WiFi.onSoftAPModeStationConnected(net_wifi_onAPModeStationConnected);
//  static auto _onSoftAPModeStationDisconnected = WiFi.onSoftAPModeStationDisconnected(net_wifi_onAPModeStationDisconnected);
#endif

  // Initially startup the netwrok to kick things off
  manageState();

  // NOTE: mDNS is intentionally NOT started here. Starting it at boot (before any
  // network interface exists) makes the mDNS predefined-interface handler join its
  // multicast group on a null netif -> esp_netif_is_netif_up(NULL) load fault,
  // seen as an even-cadence reboot loop on the ESP32-P4/ESP-Hosted build. It is now
  // tied to the netif lifecycle: startMDNS() on connect, stopMDNS() before teardown.
}

void NetManagerTask::startMDNS()
{
  // Called once a netif is actually up (STA/ETH got-IP, or SoftAP started). Restart
  // cleanly if already running so the responder re-binds to the current interface.
  if (_mdnsStarted) {
    MDNS.end();
    _mdnsStarted = false;
  }
  if (MDNS.begin(esp_hostname.c_str()))
  {
    MDNS.addService("http", "tcp", 80);
    MDNS.addService("openevse", "tcp", 80);
    MDNS.addServiceTxt("openevse", "tcp", "type", buildenv.c_str());
    MDNS.addServiceTxt("openevse", "tcp", "version", currentfirmware.c_str());
    MDNS.addServiceTxt("openevse", "tcp", "id", ESPAL.getLongId());
    _mdnsStarted = true;
  }
}

void NetManagerTask::stopMDNS()
{
  // Tear mDNS down BEFORE the WiFi netif is destroyed so its async handlers never
  // touch a freed/null interface.
  if (_mdnsStarted) {
    MDNS.end();
    _mdnsStarted = false;
  }
}

unsigned long NetManagerTask::handleMessage()
{
  MicroTasks::Message *msg;
  if(this->receive(msg))
  {
    switch (msg->id())
    {
      case NetMessage::WiFiRestart:
      case NetMessage::WiFiStop:
        wifiStopInternal();
        if(msg->id() == NetMessage::WiFiStop) { break; };

      case NetMessage::WiFiStart:
        wifiStartInternal();
        break;

      case NetMessage::WiFiAccessPointEnable:
        wifiStartAccessPoint();
        break;

      case NetMessage::WiFiAccessPointDisable:
        wifiStopAccessPoint();
        break;

      case NetMessage::NetworkEvent:
      {
        NetworkEventMessage *netEvent = static_cast<NetworkEventMessage *>(msg);
        onNetEvent(netEvent->event(), netEvent->info());
      }break;

      default:
        break;
    }

    delete msg;
  }

  return MicroTask.Infinate;
}

unsigned long NetManagerTask::serviceButton()
{
  int button = _led.getButtonPressed();

  //DBUGF("%lu %d %d", millis() - _wifiButtonTimeOut, button, _wifiButtonState);
  if(_wifiButtonState != button)
  {
    _wifiButtonState = button;
    if(WIFI_BUTTON_PRESSED_STATE == button) {
      DBUGF("Button pressed");
      _wifiButtonTimeOut = millis();
      _apMessage = false;
    } else {
      DBUGF("Button released");
      if(millis() > _wifiButtonTimeOut + WIFI_BUTTON_AP_TIMEOUT) {
        wifiStartAccessPoint();
      } else {
        displayState();
      }
    }
  }

  if(WIFI_BUTTON_PRESSED_STATE == _wifiButtonState && millis() > _wifiButtonTimeOut + WIFI_BUTTON_FACTORY_RESET_TIMEOUT)
  {
    DBUGLN("*** Factory Reset ***");

    _lcd.display(F("Factory Reset"), 0, 0, 0, LCD_CLEAR_LINE | LCD_DISPLAY_NOW);
    _lcd.display(F(""), 0, 1, 10 * 1000, LCD_CLEAR_LINE | LCD_DISPLAY_NOW);

    delay(1000);

    config_reset();
    ESPAL.eraseConfig();

    delay(50);
    ESPAL.reset();
  }
  else if(false == _apMessage && LOW == _wifiButtonState && millis() > _wifiButtonTimeOut + WIFI_BUTTON_AP_TIMEOUT)
  {
    DBUGLN("*** Enable Access Point ***");

    _lcd.display(F("Access Point"), 0, 0, 0, LCD_CLEAR_LINE | LCD_DISPLAY_NOW);
    _lcd.display(F(""), 0, 1, 10 * 1000, LCD_CLEAR_LINE | LCD_DISPLAY_NOW);
    _apMessage = true;
  }

  return 0;
}

unsigned long NetManagerTask::manageState()
{
  unsigned long delayTime = MicroTask.Infinate;

  switch (_state)
  {
    case NetState::Starting:
      #ifdef ENABLE_WIRED_ETHERNET
      wiredStart();
      #else
      wifiStartInternal();
      #endif
      break;
#ifdef ENABLE_WIRED_ETHERNET
    case NetState::WiredConnecting:
      if(millis() > _wiredTimeout) {
        DBUGF("Wired connection timed out");
        wifiStartInternal();
      } else {
        delayTime = _wiredTimeout - millis();
      }
      break;
#endif
    case NetState::StationClientConnecting:
      if(_clientDisconnects > WIFI_CLIENT_DISCONNECTS_BEFORE_AP) {
        wifiStartAccessPoint();
      }
      // Intentionally fall through to AP State for the same client reconnect logic
    case NetState::AccessPointConnecting:
      if(!isWifiClientConnected() && esid != 0 && esid != "" && millis() > _clientRetryTime) {
        wifiClientConnect();
      }

      delayTime = _clientRetryTime - millis();
      break;
    case NetState::StationClientReconnecting:
      break;
    case NetState::Connected:
      if(millis() > _apAutoApStopTime)
      {
        if(isWifiModeAp()) {
          wifiStopAccessPoint();
        }
      } else {
        delayTime = _apAutoApStopTime - millis();
      }
      break;
  }

  return delayTime;
}

unsigned long NetManagerTask::loop(MicroTasks::WakeReason reason)
{
  unsigned long nextLoopDelay = MicroTask.Infinate;

  Profile_Start(NetManagerTask::loop);

//  DBUG("NetManagerTask woke: ");
//  DBUG(NetState::Starting == _state ? "Starting" :
//       NetState::WiredConnecting == _state ? "WiredConnecting" :
//       NetState::AccessPointConnecting == _state ? "AccessPointConnecting" :
//       NetState::StationClientConnecting == _state ? "StationClientConnecting" :
//       NetState::StationClientReconnecting == _state ? "StationClientReconnecting" :
//       NetState::Connected == _state ? "Connected" :
//       "UNKNOWN");
//  DBUG(", ");
//  DBUGLN(WakeReason_Scheduled == reason ? "WakeReason_Scheduled" :
//         WakeReason_Event == reason ? "WakeReason_Event" :
//         WakeReason_Message == reason ? "WakeReason_Message" :
//         WakeReason_Manual == reason ? "WakeReason_Manual" :
//         "UNKNOWN");

